<template>
    <div class="product-container">
        说明
        <ul class="text-left list-none">
            <li>一、产品编号办法</li>
            <li>1.套产品编号：由“大写字母+小写字母+4位阿拉伯数字”构成</li>
            <li>(1)大写字母：表示品类：“A”表示卫卷、“B”表示软抽、“C”表示手帕纸，以此类推，根据品类生产的先后顺序编排</li>
            <li>(2)小写字母：表示产品类型：“a”表示常规品、“b”表示非常规品、“c”表示特规品。</li>
            <li>(3)4位阿拉伯数字：按生产的先后顺序自动编码，各品类、各产品类型各自编码。</li>
            <li>2.单幅产品编号：由5位阿拉伯数字构成，按生产的先后顺序自动编码，各品类、各产品类型各自编码。</li>
            <li>二、卫卷产品编号规则（以卫卷为例进行说明，其它品类规则与卫卷相同）</li>
            <li>（一）常规卫卷</li>
            <li>1.套产品：同一卫卷（品类）产品、不同的分切规格、不同的定量作为一个套产品。</li>
            <li>2.套产品编号：按常规品开发生产的时间先后顺序进行排序。</li>
            <li>3.单幅产品编号：同定量、同规格同编号，系统自动识别，自动按生产时间前后次序自动编码。</li>
            <li>4.单幅产品：同一卫卷（品类）产品、同一分切规格、同一定量、同一物理指标作为企业一个单幅产品。</li>
            <li>单幅产品名称产生：按单幅产品的开发生产的时间先后顺序自动产生，生成规则：常卫+顺序号，如常卫1、常卫2。</li>
            <li>（二）非常规卫卷</li>
            <li>1.套产品：同一卫卷（品类）产品、不同的分切规格、不同的定量作为一个套产品。</li>
            <li>2.套产品编号：以所有的用户为单位，按产品的生成前后次序混排，如果出现用户同等的套产品，改用户的套产品编号相同
                如果该用户改产品没有使用过的，用户的套产品编号不同。
            </li>
            <li>3.单幅产品编号：以所有的用户为单位，同定量、同规格同编号，系统自动识别，自动按生产前后次序自动编码。</li>
            <li>4.用户套产品编号：（1）用户识别码：第一个三位数；（2）用户套产品编码：第二个三位数；
                （3）用户单幅产品编号：以用户为单位，不同的规格不同的定量不同的编号，按顺序自动混编。</li>
            <li>5.单幅产品：同一卫卷（品类）产品、同一分切规格、同一定量、同一物理指标作为企业一个单幅产品。</li>
            <li>6.单幅产品名称号产生：按单幅产品的开发生产的时间先后顺序自动产生。</li>
            <li>（三）特规卫卷</li>
            <li>1.企业套产品：以企业为单位，同一卫卷（品类）产品、出现任何不同的茶农规格和物理指标的，就作为一个企业套产品。</li>
            <li>2.企业套产品编号：以所有的用户为单位，按产品的生产前后次序混排。</li>
            <li>3.企业单幅产品编号:以所有的用户为单位，所有规格相同，所有物理指标相同，同一编号，系统自动识别，自动按生产先后次序自动编码。</li>
            <li>4.用户套产品编号：（1）用户识别码：第一个三位数；（2）用户套产品编码：第二个三位数；（3）用户单幅产品编号：一用户为单位，
                不同的规格不同的定量不同的编码，按顺序自动混编。（4）如果用户其他相同的企业套产品，该用户的企业套产品编号相同。
            </li>
            <li>5.单幅产品：以企业为单位，同一卫卷（品类）产品，所有规格相同，所有物理指标相同的，同一名称，系统自动识别。</li>
            <li>6.单幅产品名称号产生：按单幅产品开发生产的时间先后顺序自动产生。</li>
        </ul>
    </div>
</template>

<script>
export default {

}
</script>
<style scoped>
    .list-none{
        list-style-type: none
    }
</style>

